* Udemy [[https://www.udemy.com/course/linux-shell-scripting-projects/learn/lecture/7980218?start=0#overview][Linux Shell Scripting]] 
  - We will use Vagrant in this course to create a lab so ensure that we do not screw the local machine
  - When running =vagrant -h= 
    #+begin_src zsh
    vagrant -h
    #+end_src

    #+RESULTS:
    | Usage:        | vagrant         | [options]   | <command>     | [<args>]      |              |             |               |            |             |         |
    | -v,           | --version       | Print       | the           | version       | and          | exit.       |               |            |             |         |
    | -h,           | --help          | Print       | this          | help.         |              |             |               |            |             |         |
    | Common        | commands:       |             |               |               |              |             |               |            |             |         |
    | box           | manages         | boxes:      | installation, | removal,      | etc.         |             |               |            |             |         |
    | cloud         | manages         | everything  | related       | to            | Vagrant      | Cloud       |               |            |             |         |
    | destroy       | stops           | and         | deletes       | all           | traces       | of          | the           | vagrant    | machine     |         |
    | global-status | outputs         | status      | Vagrant       | environments  | for          | this        | user          |            |             |         |
    | halt          | stops           | the         | vagrant       | machine       |              |             |               |            |             |         |
    | help          | shows           | the         | help          | for           | a            | subcommand  |               |            |             |         |
    | init          | initializes     | a           | new           | Vagrant       | environment  | by          | creating      | a          | Vagrantfile |         |
    | login         |                 |             |               |               |              |             |               |            |             |         |
    | package       | packages        | a           | running       | vagrant       | environment  | into        | a             | box        |             |         |
    | plugin        | manages         | plugins:    | install,      | uninstall,    | update,      | etc.        |               |            |             |         |
    | port          | displays        | information | about         | guest         | port         | mappings    |               |            |             |         |
    | powershell    | connects        | to          | machine       | via           | powershell   | remoting    |               |            |             |         |
    | provision     | provisions      | the         | vagrant       | machine       |              |             |               |            |             |         |
    | push          | deploys         | code        | in            | this          | environment  | to          | a             | configured | destination |         |
    | rdp           | connects        | to          | machine       | via           | RDP          |             |               |            |             |         |
    | reload        | restarts        | vagrant     | machine,      | loads         | new          | Vagrantfile | configuration |            |             |         |
    | resume        | resume          | a           | suspended     | vagrant       | machine      |             |               |            |             |         |
    | snapshot      | manages         | snapshots:  | saving,       | restoring,    | etc.         |             |               |            |             |         |
    | ssh           | connects        | to          | machine       | via           | SSH          |             |               |            |             |         |
    | ssh-config    | outputs         | OpenSSH     | valid         | configuration | to           | connect     | to            | the        | machine     |         |
    | status        | outputs         | status      | of            | the           | vagrant      | machine     |               |            |             |         |
    | suspend       | suspends        | the         | machine       |               |              |             |               |            |             |         |
    | up            | starts          | and         | provisions    | the           | vagrant      | environment |               |            |             |         |
    | upload        | upload          | to          | machine       | via           | communicator |             |               |            |             |         |
    | validate      | validates       | the         | Vagrantfile   |               |              |             |               |            |             |         |
    | version       | prints          | current     | and           | latest        | Vagrant      | version     |               |            |             |         |
    | winrm         | executes        | commands    | on            | a             | machine      | via         | WinRM         |            |             |         |
    | winrm-config  | outputs         | WinRM       | configuration | to            | connect      | to          | the           | machine    |             |         |
    | For           | help            | on          | any           | individual    | command      | run         | `vagrant      | COMMAND    | -h`         |         |
    | Additional    | subcommands     | are         | available,    | but           | are          | either      | more          | advanced   |             |         |
    | or            | not             | commonly    | used.         | To            | see          | all         | subcommands,  | run        | the         | command |
    | `vagrant      | list-commands`. |             |               |               |              |             |               |            |             |         |
** [[./vm1/Vagrantfile][./vm1/Vagrantfile]]  
   

